using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ExamGeneartorApp.Data
{
    public class ExamQuestions
    {
        public static string[] GetQuestions()
        {
            return new string[] {
            "Дати визначення поняття «програмування»?",
            "Дати визначення поняття «мова програмування»?",
            "Дати визначення поняття «задача»?",
            "Дати визначення поняття «алгоритм»?",
            "Перелічіть властивості алгоритмів.",
            "Якими способами можна представити алгоритм?",
            "Які типові блоки для формування блок-схем алгоритмів ви знаєте? Як вони зображуються графічно?",
            "Що таке MS Visual Studio?",
            "Для чого призначена функція Main()?",
            "Який клас використовується для роботи із консоллю?",
            "Що таке тип даних?",
            "Дайте класифікацію типів даних .NET.",
            "Що таке змінна? Який синтаксис оголошення змінної.",
            "Що таке константа? Який синтаксис оголошення констант?",
            "Що таке область видимості змінної?",
            "Які види операторів існують у C#?",
            "Що таке інкремент та декремент? Яка різниця між постфіксним та прфіксним записом цих операторів?",
            "Що таке літерал? Який синтаксис запису літералів для різних типів даних.",
            "Що таке приведення типів даних?",
            "Яка різниця та синтаксис явного та неявного приведення типів даних?",
            "Опишіть основні характеристики значимих типів даних.",
            "Опишіть основні характеристики посилальних типів даних.",
            "Які оператори розгалуження ви знаєте? Для чого вони використовуються?",
            "Опишіть синтаксис та можливі варіанти використання конструкції if-else.",
            "Опишіть синтаксис та можливі варіанти використання конструкції switch.",
            "Опишіть синтаксис та можливі варіанти використання тернарного оператора.",
            "Які цикли існують у C#? Для чого вони використовуються?",
            "Опишіть синтаксис та можливі варіанти використання циклу for.",
            "Опишіть синтаксис та можливі варіанти використання циклу while.",
            "Опишіть синтаксис та можливі варіанти використання циклу do-while.",
            "Що таке масив?",
            "Які типи масивів у C# ви знаєте?",
            "Які основні методи класу Array, як вони працюють?",
            "Назвіть відомі Вам алгоритми сортування масивів.",
            "Що таке перелічуваний тип?",
            "Що таке структура?",
            "З яких елементів складається структура?"
                    };
        }
    }
}
