using VarDemo;

var demo = new OaKnStructure();
var a = 10;
var b = new int[3,4];

var r = new Random();
Random r2 = new();

// Напишіть програму, яка обчислює середнє арифметичне всіх елементів масиву.
// Елементи масиву генеруються випадковим чином у діапазоні [10;20].
// Масив складається з 10 елементів.

// Дано масив цілих чисел. Масив складається з 5 елементів.
// Елементи масиву генеруються випадковим чином у діапазоні [1;7].
// Необхідно знайти всі унікальні елементи, тобто такі, що зустрічаються в масиві лише один раз.

